<a href="https://colab.research.google.com/github/kkattt51/ArtInt/blob/main/6_Addition_ipynb%22.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
#df_1 = pd.read_csv('titanic_data.csv')
#pass_link = 'https://www.dropbox.com/s/lyzcuxu1pdrw5qb/titanic_data.csv?dl=1'
#data = pd.read_csv(pass_link, ) #index_col=?
data = pd.read_csv('https://www.dropbox.com/s/lyzcuxu1pdrw5qb/titanic_data.csv?dl=1')

In [ ]:
data.head(5)

   PassengerId  Pclass  ... Cabin Embarked
0            1       3  ...   NaN        S
1            2       1  ...   C85        C
2            3       3  ...   NaN        S
3            4       1  ...  C123        S
4            5       3  ...   NaN        S

[5 rows x 11 columns]

Задание 1
Опишите данный датасет: какое расределение женщин/мужчин в нем? Сколько пассажиров ехало в каждом классе? Какой средний/минимальный/максимальный возраст пассажиров?

In [ ]:
#data.info()
#data.shape[0]
#data.size
#data['Sex'].value_counts()
data.Age.max(), data.Age.min(), data.Age.mean()
data.Pclass.value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

Задание 2. Сгруппируйте записи по классам пассажиров, в каждой группе посчитайте средний возраст. Используйте метод pandas.DataFrame.groupby.

In [ ]:
data.groupby('Pclass')['Age'].mean()

Pclass
1    38.233441
2    29.877630
3    25.140620
Name: Age, dtype: float64

In [ ]:
data.groupby('Pclass')['Fare'].max()

Pclass
1    512.3292
2     73.5000
3     69.5500
Name: Fare, dtype: float64

Задание 3. Слияние таблиц Слейте два датасета по колонке индекса.

In [ ]:
#df_2 = pd.read_csv('titanic_surv.csv')
surv_link = 'https://www.dropbox.com/s/v35x9i6a1tc7emm/titanic_surv.csv?dl=1'
df_2 = pd.read_csv(surv_link)

Задание Сколько всего выживших пассажиров? Выживших пассажиров по каждому из полов? Постройте матрицу корреляций факта выживания, пола и возраста.

In [ ]:
df_2

     Survived
0           0
1           1
2           1
3           1
4           0
..        ...
886         0
887         1
888         0
889         1
890         0

[891 rows x 1 columns]

In [ ]:
data['survided'] = df_2
df_2.index = np.arange(0, 891)
#df_2.tail(5)
df_2.head()

   Survived
0         0
1         1
2         1
3         1
4         0

In [ ]:
data['survided'].value_counts()

0    549
1    342
Name: survided, dtype: int64

In [ ]:
data.groupby('survided')['Sex'].value_counts()

survided  Sex
0         male      468
          female     81
1         female    233
          male      109
Name: Sex, dtype: int64

In [ ]:
data[data['Sex'] == 'male']['survided'].value_counts()

0    468
1    109
Name: survided, dtype: int64

In [ ]:
data[data['Sex'] == 'female']['survided'].value_counts()

1    233
0     81
Name: survided, dtype: int64

In [ ]:
data[data['survided'] == 1]['Sex'].value_counts()

female    233
male      109
Name: Sex, dtype: int64

In [ ]:
data_cor = data[['survided', 'Age', 'Sex']]
data_cor

     survided   Age     Sex
0           0  22.0    male
1           1  38.0  female
2           1  26.0  female
3           1  35.0  female
4           0  35.0    male
..        ...   ...     ...
886         0  27.0    male
887         1  19.0  female
888         0   NaN  female
889         1  26.0    male
890         0  32.0    male

[891 rows x 3 columns]

In [ ]:
data_cor.loc[data_cor['Sex'] == 'male', 'Sex'] = 0
data_cor.loc[data_cor['Sex'] == 'female', 'Sex'] = 1

/usr/local/lib/python3.7/dist-packages/pandas/core/indexing.py:1763: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  isetter(loc, value)

In [ ]:
data_cor['Sex'] = data_cor['Sex'].astype('int')

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [ ]:
data_cor.corr()

          survided       Age       Sex
survided  1.000000 -0.077221  0.543351
Age      -0.077221  1.000000 -0.093254
Sex       0.543351 -0.093254  1.000000